app/controllers/goals_controller.rb

  def show
    ud = UserDataFactory.new.get current_user, Userdatum
    @goal = Goal.where("userdatum_id = ? AND id = ?", ud.id, params[:id])
---
SELECT "goals".* FROM "goals" WHERE "goals"."id" = ? LIMIT 1  [["id", "1"]]

  def create
    @goal = Goal.new(params[:goal])
    @goal.userdatum = UserDataFactory.new.get current_user, Userdatum

    respond_to do |format|
      if @goal.save
---
INSERT INTO "goals" ("created_at", "instances", "pledgetype_id", "project_id", "total", "updated_at") VALUES (?, ?, ?, ?, ?, ?)