app/controllers/pledges_controller.rb

  def index
    @pledges = Pledge.all
---
SELECT "pledges".* FROM "pledges"

  def show
    @pledge = Pledge.find(params[:id])
---
SELECT "pledges".* FROM "pledges" WHERE "pledges"."id" = ? LIMIT 1  [["id", "1"]]

  def create
    ud = UserDataFactory.new.get current_user, Userdatum
    pledgetype = PledgeType.find(params[:pledge_type_id])
    @pledge = Pledge.new()
    @pledge.userdatum = ud
    @pledge.pledge_type = pledgetype
    @pledge.amount = params[:amount]

    respond_to do |format|
      if @pledge.save
---
INSERT INTO "pledges" ("amount", "created_at", "pledgetype_id", "updated_at", "userdata_id") VALUES (?, ?, ?, ?, ?)