app/controllers/pledge_types_controller.rb

SELECT "pledge_types".* FROM "pledge_types"
---
  def index
    @pledge_types = PledgeType.all

SELECT "pledge_types".* FROM "pledge_types" WHERE "pledge_types"."id" = ? LIMIT 1  [["id", "1"]]
---
  def show
    @pledge_type = PledgeType.find(params[:id])

INSERT INTO "pledge_types" ("created_at", "desc", "image", "name", "project_id", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
---
  def create
    @pledge_type = PledgeType.new(params[:pledge_type])

    respond_to do |format|
      if @pledge_type.save