app/controllers/projects_controller.rb

INSERT INTO "projects" ("created_at", "desc", "image", "name", "updated_at", "userdata_id") VALUES (?, ?, ?, ?, ?, ?)
---
  def create

    # Get the userdata for this user
    ud = UserDataFactory.new.get current_user, Userdatum
    @project = Project.new(params[:project])
    @project.userdatum = ud

    respond_to do |format|
      if @project.save